In [50]:
import pandas as pd
import numpy as np

In [51]:
data = pd.read_csv("Dataset.csv")
type(data)

pandas.core.frame.DataFrame

In [52]:
# display the first 5 rows
print(data.head())

   id  age  salary department  experience_years        city  \
0   1   56   28392      Sales                15    Lalitpur
1   2   46   50535         HR                18      Butwal
2   3   32   98603         HR                 3   Kathmandu
3   4   25   72256    Finance                 2      Butwal
4   5   38  109135         IT                16  Biratnagar

   performance_score  bonus  gender  is_active
0               3.02  14216    Male       True
1               4.31   7132  Female       True
2               2.28   8891  Female       True
3               4.58  11700    Male      False
4               2.56   3779    Male       True

In [53]:
# display the last 5 rows
print(data.tail())

     id  age  salary department  experience_years       city  \
95   96   59  105616      Sales                 6  Kathmandu
96   97   56  113264         HR                 4   Lalitpur
97   98   58   46736  Marketing                 2  Kathmandu
98   99   45  114209         HR                11  Kathmandu
99  100   24   20854      Sales                15  Kathmandu

    performance_score  bonus  gender  is_active
95               1.31   5719  Female       True
96               4.90   3814  Female      False
97               4.94   4374    Male      False
98               3.79  12470  Female      False
99               3.14   2252  Female      False

In [54]:
# shape of the DataFrame
print(data.shape)

(100, 10)

In [55]:
# Datatype of the dataframe
print(data.dtypes)

id                     int64
age                    int64
salary                 int64
department            object
experience_years       int64
city                  object
performance_score    float64
bonus                  int64
gender                object
is_active               bool
dtype: object

In [56]:
# All theinformation about the DataFrame
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 100 non-null    int64
 1   age                100 non-null    int64
 2   salary             100 non-null    int64
 3   department         100 non-null    object
 4   experience_years   100 non-null    int64
 5   city               100 non-null    object
 6   performance_score  100 non-null    float64
 7   bonus              100 non-null    int64
 8   gender             100 non-null    object
 9   is_active          100 non-null    bool
dtypes: bool(1), float64(1), int64(5), object(3)
memory usage: 7.3+ KB
None

In [57]:

type(data.age)
# This means every column is a pandas Series

pandas.core.series.Series

Manipulating dataframe

In [58]:
data['Incremented_Salary'] = data["experience_years"]*500 + data["salary"]
# print(data.head())
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  100 non-null    int64
 1   age                 100 non-null    int64
 2   salary              100 non-null    int64
 3   department          100 non-null    object
 4   experience_years    100 non-null    int64
 5   city                100 non-null    object
 6   performance_score   100 non-null    float64
 7   bonus               100 non-null    int64
 8   gender              100 non-null    object
 9   is_active           100 non-null    bool
 10  Incremented_Salary  100 non-null    int64
dtypes: bool(1), float64(1), int64(6), object(3)
memory usage: 8.0+ KB
None

In [59]:
dat = data.copy() #copy of data

# adding a new row
dat.loc[100] = [101,25, 70000,'HR',3,"Kathmandu",2.5,1000,"male",True,75000] 

print(dat.tail())

dat.info()

      id  age  salary department  experience_years       city  \
96    97   56  113264         HR                 4   Lalitpur
97    98   58   46736  Marketing                 2  Kathmandu
98    99   45  114209         HR                11  Kathmandu
99   100   24   20854      Sales                15  Kathmandu
100  101   25   70000         HR                 3  Kathmandu

     performance_score  bonus  gender  is_active  Incremented_Salary
96                4.90   3814  Female      False              115264
97                4.94   4374    Male      False               47736
98                3.79  12470  Female      False              119709
99                3.14   2252  Female      False               28354
100               2.50   1000    male       True               75000
<class 'pandas.core.frame.DataFrame'>
Index: 101 entries, 0 to 100
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  101 non-null    int64
 1   age                 101 non-null    int64
 2   salary              101 non-null    int64
 3   department          101 non-null    object
 4   experience_years    101 non-null    int64
 5   city                101 non-null    object
 6   performance_score   101 non-null    float64
 7   bonus               101 non-null    int64
 8   gender              101 non-null    object
 9   is_active           101 non-null    bool
 10  Incremented_Salary  101 non-null    int64
dtypes: bool(1), float64(1), int64(6), object(3)
memory usage: 8.8+ KB

In [60]:
# selecting the row using .iloc

data.iloc[2]

id                            3
age                          32
salary                    98603
department                   HR
experience_years              3
city                  Kathmandu
performance_score          2.28
bonus                      8891
gender                   Female
is_active                  True
Incremented_Salary       100103
Name: 2, dtype: object

In [61]:
# selecting multiple rows as per req

peo=(data.iloc[[2,3,56]]).copy()
print(peo)

peo.info()

    id  age  salary department  experience_years       city  \
2    3   32   98603         HR                 3  Kathmandu
3    4   25   72256    Finance                 2     Butwal
56  57   59   46105         HR                19     Butwal

    performance_score  bonus  gender  is_active  Incremented_Salary
2                2.28   8891  Female       True              100103
3                4.58  11700    Male      False               73256
56               1.23   8140    Male       True               55605
<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 2 to 56
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  3 non-null      int64
 1   age                 3 non-null      int64
 2   salary              3 non-null      int64
 3   department          3 non-null      object
 4   experience_years    3 non-null      int64
 5   city                3 non-null      object
 6   performance_score   3 non-null      float64
 7   bonus               3 non-null      int64
 8   gender              3 non-null      object
 9   is_active           3 non-null      bool
 10  Incremented_Salary  3 non-null      int64
dtypes: bool(1), float64(1), int64(6), object(3)
memory usage: 267.0+ bytes

In [62]:
# Display the rows from 20 to 28

data.iloc[20:29]

,id,age,salary,department,experience_years,city,performance_score,bonus,gender,is_active,Incremented_Salary
20,21,19,118806,Sales,9,Pokhara,1.36,8409,Female,True,123306
21,22,38,26910,Finance,2,Biratnagar,2.98,8418,Male,True,27910
22,23,50,110982,Marketing,7,Pokhara,1.23,14164,Female,True,114482
23,24,29,20206,Marketing,13,Pokhara,3.20,6124,Male,False,26706
24,25,39,107054,Finance,17,Lalitpur,2.77,2015,Female,True,115554
25,26,42,107897,Marketing,14,Pokhara,4.55,11016,Male,True,114897
26,27,44,43419,Finance,1,Kathmandu,2.40,13661,Female,True,43919
27,28,59,70636,IT,9,Butwal,1.47,12328,Female,False,75136
28,29,45,70015,Finance,1,Butwal,1.57,3193,Male,False,70515

In [63]:
# select the second column of the data frame only 5 values

print(data.iloc[:5,1])
print()

# select the last columna of the data frame onlu last five values
print(data.iloc[95:,-1])
print()
print(data.iloc[-5:,-1])

0    56
1    46
2    32
3    25
4    38
Name: age, dtype: int64

95    108616
96    115264
97     47736
98    119709
99     28354
Name: Incremented_Salary, dtype: int64

95    108616
96    115264
97     47736
98    119709
99     28354
Name: Incremented_Salary, dtype: int64

In [64]:
# indexing through loc

data.loc[:6,["age","salary"]]

   age  salary
0   56   28392
1   46   50535
2   32   98603
3   25   72256
4   38  109135
5   56   55222
6   36   97373

In [65]:
# selecting column by different way

print(data.age)
print()
print(data[["age","salary","experience_years"]])

0     56
1     46
2     32
3     25
4     38
      ..
95    59
96    56
97    58
98    45
99    24
Name: age, Length: 100, dtype: int64

    age  salary  experience_years
0    56   28392                15
1    46   50535                18
2    32   98603                 3
3    25   72256                 2
4    38  109135                16
..  ...     ...               ...
95   59  105616                 6
96   56  113264                 4
97   58   46736                 2
98   45  114209                11
99   24   20854                15

[100 rows x 3 columns]

In [66]:
# sorting the daataframe

data.sort_values("age")

,id,age,salary,department,experience_years,city,performance_score,bonus,gender,is_active,Incremented_Salary
80,81,18,113557,Marketing,18,Kathmandu,2.82,9865,Male,True,122557
85,86,18,71005,HR,11,Lalitpur,2.12,5363,Female,False,76505
20,21,19,118806,Sales,9,Pokhara,1.36,8409,Female,True,123306
16,17,19,99309,HR,19,Pokhara,3.69,11136,Male,False,108809
54,55,19,41834,Finance,18,Biratnagar,1.05,2460,Male,True,50834
...,...,...,...,...,...,...,...,...,...,...,...
77,78,58,86199,HR,12,Kathmandu,3.09,8239,Male,False,92199
97,98,58,46736,Marketing,2,Kathmandu,4.94,4374,Male,False,47736
27,28,59,70636,IT,9,Butwal,1.47,12328,Female,False,75136
56,57,59,46105,HR,19,Butwal,1.23,8140,Male,True,55605
95,96,59,105616,Sales,6,Kathmandu,1.31,5719,Female,True,108616

In [69]:
# rank the age

data["age_rank"]=data["age"].rank(ascending=0,method="min")
print(data)

     id  age  salary department  experience_years        city  \
0     1   56   28392      Sales                15    Lalitpur
1     2   46   50535         HR                18      Butwal
2     3   32   98603         HR                 3   Kathmandu
3     4   25   72256    Finance                 2      Butwal
4     5   38  109135         IT                16  Biratnagar
..  ...  ...     ...        ...               ...         ...
95   96   59  105616      Sales                 6   Kathmandu
96   97   56  113264         HR                 4    Lalitpur
97   98   58   46736  Marketing                 2   Kathmandu
98   99   45  114209         HR                11   Kathmandu
99  100   24   20854      Sales                15   Kathmandu

    performance_score  bonus  gender  is_active  Incremented_Salary  age_rank
0                3.02  14216    Male       True               35892       9.0
1                4.31   7132  Female       True               59535      26.0
2                2.28   8891  Female       True              100103      63.0
3                4.58  11700    Male      False               73256      79.0
4                2.56   3779    Male       True              117135      50.0
..                ...    ...     ...        ...                 ...       ...
95               1.31   5719  Female       True              108616       1.0
96               4.90   3814  Female      False              115264       9.0
97               4.94   4374    Male      False               47736       4.0
98               3.79  12470  Female      False              119709      29.0
99               3.14   2252  Female      False               28354      84.0

[100 rows x 12 columns]

In [ ]:
# checking if their is any null value in dataframe
data.isnull().sum()

id                    0
age                   0
salary                0
department            0
experience_years      0
city                  0
performance_score     0
bonus                 0
gender                0
is_active             0
Incremented_Salary    0
age_rank              0
dtype: int64